# Задача 3. Следующее и предыдущее числа
chislo = int(input('Введите любое число: '))

print('После числа',chislo,'идёт число ',chislo+1)
print('Перед числом',chislo,'идёт число',chislo-1)