# Задача 4. Площадь треугольника

a = int(input('Введите длину первого катета: '))
b = int(input('Введите длину второго катета: '))

print('Площадь прямоугольного треугольника равна:',(a+b)/2)